using System;


class Program
{
    static void Main()
    {   /*Напишете програма, която приема за вход четирицифрено число във формат abcd (например числото 2011) и след това
         извършва следните действия върху него:
        - Пресмята сбора от цифрите на числото (за нашия пример 2+0+1+1 = 4).
        - Разпечатва на конзолата цифрите в обратен ред: dcba (за нашия пример резултатът е 1102).
        - Поставя последната цифра на първо място: dabc (за нашия пример резултатът е 1201).
        - Разменя мястото на втората и третата цифра: acbd (за нашия пример резултатът е 2101). */

        Console.Write("Въведи число: ");
        int number = int.Parse(Console.ReadLine());
        int a = number / 1000;
        int b = (number / 100) % 10;
        int c = (number / 10) % 10;
        int d = number % 10;

        Console.WriteLine("1.Сбор на цифрите = {0}", a + b + c + d);
        Console.WriteLine("2.Цифрите в обратен ред = {3}{2}{1}{0}", a, b, c, d);
        Console.WriteLine("3.Последна цифра на първо място = {3}{0}{1}{2}", a, b, c, d);
        Console.WriteLine("4.Размяна на трета и втора цифра = {0}{2}{1}{3}", a, b, c, d);

    }
}

